In [1]:
import sys

In [2]:
sys.version_info

sys.version_info(major=3, minor=7, micro=3, releaselevel='final', serial=0)

In [3]:
if sys.platform == 'darwin' :
    print(" Mac OS")
else :
    print(" Windows ")

 Mac OS

# 1. 그룹화 처리

     특정 열의 값들을 범주화해서 분리하고 이를 기준으로 계산한 집계를 표시할 수 있습니다.
     
     집계 계산도 특정 열 단위로 처리도 가능합니다.

## 그룹화 처리기준 : 분할, 적용, 조합 

         - 분할 : 특정 값별로 분리
         - 적용 : 분할된 것별로 특정 함수나 메소드 처리
         - 조합 : 적용된 것을 합하기

### 시본 데이터 가져오기

In [4]:
import seaborn as sns

In [5]:
tips = sns.load_dataset("tips")

In [6]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [8]:
tips.ndim

2

In [9]:
tips.shape

(244, 7)

## 1-1 특정 열을 기준으로 그룹화

      특정 범주를 지정하면 이 기준이 행의 인덱스가 되고 나머지는 열로 처리됩니다.

### 범주화 값 확인하기

In [10]:
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

### 그룹화 처리

In [11]:
t_gr = tips.groupby('sex')

### 두 개의 범주로 그룹 처리

In [12]:
t_gr.ngroups

2

### 그룹화하면 별로의 클래스의 객체가 생성됩니다.

In [13]:
t_gr

## 1-2 그룹화 객체의 속성 알아보기

In [14]:
t_gr_Male = t_gr.get_group('Male')

In [15]:
type(t_gr_Male)

pandas.core.frame.DataFrame

### 그룹화 내부의 값을 가져오기

In [16]:
t_gr.groups['Male']

Int64Index([  1,   2,   3,   5,   6,   7,   8,   9,  10,  12,
            ...
            231, 232, 233, 234, 235, 236, 237, 239, 241, 242],
           dtype='int64', length=157)

In [17]:
t_gr_Female = t_gr.get_group('Female')

#### 그룹화 처리된 행 인덱스를 확인

In [18]:
type(t_gr_Female)

pandas.core.frame.DataFrame

In [19]:
t_gr.groups['Female']

Int64Index([  0,   4,  11,  14,  16,  18,  21,  22,  29,  32,  33,  37,  51,
             52,  57,  66,  67,  71,  72,  73,  74,  82,  85,  92,  93,  94,
            100, 101, 102, 103, 104, 109, 111, 114, 115, 117, 118, 119, 121,
            124, 125, 127, 128, 131, 132, 133, 134, 135, 136, 137, 139, 140,
            143, 144, 145, 146, 147, 155, 157, 158, 162, 164, 168, 169, 178,
            186, 188, 191, 197, 198, 201, 202, 203, 205, 209, 213, 214, 215,
            219, 221, 223, 225, 226, 229, 238, 240, 243],
           dtype='int64')

### 그룹화 된 결과를 가져오면 튜플로 처리됨

In [20]:
male, female = t_gr

In [21]:
type(male)

tuple

#### 첫번째는 그룹화 기준

In [22]:
male[0]

'Male'

#### 두번째는 그룹화된 결과

In [23]:
male[1][:5]

   total_bill   tip   sex smoker  day    time  size
1       10.34  1.66  Male     No  Sun  Dinner     3
2       21.01  3.50  Male     No  Sun  Dinner     3
3       23.68  3.31  Male     No  Sun  Dinner     2
5       25.29  4.71  Male     No  Sun  Dinner     4
6        8.77  2.00  Male     No  Sun  Dinner     2

#### 그룹화된 기준 확인

In [24]:
for name, group_ in t_gr :
    print("name ", name)

name  Male
name  Female

#### 그룹으로 묶인 개수를 확인할 수 있다.

In [25]:
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [26]:
t_gr.size()

sex
Male      157
Female     87
dtype: int64

#### 그룹화된 내용을 처리하기

In [27]:
t_gr.get_group("Male").count()

total_bill    157
tip           157
sex           157
smoker        157
day           157
time          157
size          157
dtype: int64

In [28]:
t_gr.get_group("Female").count()

total_bill    87
tip           87
sex           87
smoker        87
day           87
time          87
size          87
dtype: int64

## 1-3 그룹화된 행의 정보를 확인하기

In [29]:
t_gr.get_group('Male').iloc[5]

total_bill     26.88
tip             3.12
sex             Male
smoker            No
day              Sun
time          Dinner
size               4
Name: 7, dtype: object

In [30]:
t_gr.get_group('Female').iloc[5]

total_bill     16.97
tip              3.5
sex           Female
smoker            No
day              Sun
time          Dinner
size               3
Name: 18, dtype: object

In [31]:
t_gr.nth(5)

        total_bill   tip smoker  day    time  size
sex
Male         26.88  3.12     No  Sun  Dinner     4
Female       16.97  3.50     No  Sun  Dinner     3

### 그룹화된 임의의 정보를 가져오기

In [51]:
t_gr.head()

    total_bill   tip     sex smoker  day    time  size
0        16.99  1.01  Female     No  Sun  Dinner     2
1        10.34  1.66    Male     No  Sun  Dinner     3
2        21.01  3.50    Male     No  Sun  Dinner     3
3        23.68  3.31    Male     No  Sun  Dinner     2
4        24.59  3.61  Female     No  Sun  Dinner     4
5        25.29  4.71    Male     No  Sun  Dinner     4
6         8.77  2.00    Male     No  Sun  Dinner     2
11       35.26  5.00  Female     No  Sun  Dinner     4
14       14.83  3.02  Female     No  Sun  Dinner     2
16       10.33  1.67  Female     No  Sun  Dinner     3

In [52]:
t_gr.tail()

     total_bill   tip     sex smoker   day    time  size
226       10.09  2.00  Female    Yes   Fri   Lunch     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
236       12.60  1.00    Male    Yes   Sat  Dinner     2
237       32.83  1.17    Male    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2